#!/bin/bash
#shift shift 命令重新分配位置参数,其实就是向左移动一个位置.
#$1 <--- $2, $2 <--- $3, $3 <--- $4, 等等.
#老的$1 将消失,但是$0(脚本名)是不会改变的.如果你使用了大量的位置参数,那么
#shift命令允许你存取超过10 个参数.虽然{}表示法也允许这样.
#Example 4-7 使用shift
################################Start
#Script#######################################
 #!/bin/bash
 # 使用'shift'来穿过所有的位置参数.

 # 把这个脚本命名为shft,
 #+ 并且使用一些参数来调用它,如:
 # ./shft a b c def 23 skidoo
sum=0
until [ -z "$1" ] #  直到所有参数都用光
do
	echo -n "$1 "
	shift
	printf "\n"
	sum=$((sum+=1))
done

echo  All argu num: "$sum " 
# 额外的换行.

exit 0
################################
